Repository: marcosjunqueira/sonar-l10n-pt-omegat
Catalog: tm/editor-omegat.tmx
Source language: en_us
Languages: pt_br

source: The infrastructure and API for working with editor hints.
pt_br: A infra-estrutura e API para trabalhar com dicas no editor

source: Fixable Warning
pt_br: Aviso corrigível

source: Fixable Verifier Warning
pt_br: Verificador de avisos corrigíveis

source: Verifier Warning
pt_br: Verificador de aviso

source: Fixable TODO
pt_br: TODO corrigível

source: Fixable Hint
pt_br: Dica corrigível

source: Hint
pt_br: Dica

source: Fixable Error
pt_br: Erro corrigível

source: Open Problem Window
pt_br: Abrir janela de problema

source: Problem Window
pt_br: Janela de problema

source: This is a Problem window
pt_br: Esta é uma janela de problema

source: Enabled
pt_br: Habilitado

source: <html>On Project Open <i>requires restart</i>
pt_br: <html>Em projeto aberto <i>precisa ser reiniciado</i>

source: <html>On Demand
pt_br: <html>Por demanda

source: <html>Lazy
pt_br: <html>Lento

source: Experimental Editor Highlights
pt_br: Editor experimental de realce

source: Use org.netbeans.spi.highlighting (Editor Library 2) instead.
pt_br: Usar org.netbeans.spi.highlighting (Biblioteca do editor 2) no lugar.

source: Editor Error Stripe
pt_br: Lista de erros no editor

source: The API for the right hand side bar showing errors, hints, etc.
pt_br: A API para a barra lateral direita de exibição de erros, dicas etc.

source: The API for the right hand side bar showing errors, hints and other editor annotations.
pt_br: A API para a barra lateral direita de exibição de erros, dicas e outras anotações no editor.

source: Error Stripe
pt_br: Lista de erros

source: No errors
pt_br: Sem erros

source: {0} warning(s)
pt_br: {0} aviso(s)

source: {0} error(s)
pt_br: {0} erro(s)

source: {0} error(s), {1} warning(s)
pt_br: {0} erro(s), {1} aviso(s)

source: Current Line
pt_br: Linha atual

source: Annotation view side bar
pt_br: Barra lateral de visualização de anotação

source: Annotation view shows positions of text annotations with a document
pt_br: A visualização de anotação exibe a posição das anotações dentro do texto do documento

source: Editor Error Stripe Impl
pt_br: Implementação para lista de erros no editor

source: The right hand side bar showing errors, hints, etc.
pt_br: A barra lateral direita para exibição de erros, dicas etc.

source: The implementation of the right hand side bar showing errors, hints and other editor annotations.
pt_br: Implementação da barra lateral direita para exibição de erros, dicas e outras anotações no editor.

source: Editor Utilities
pt_br: Utilitários do editor

source: Contains various support classes for editor related modules
pt_br: Contém várias classes de suporte aos módulos relacionados a edição

source: Editor Utilities module contains various utility classes and methods for functionality related to editing
pt_br: O módulo utilitários do editor contém varias classes e métodos úteis para funcionalidades relacionada à edição

source: Next Bookmark
pt_br: Próximo marcador

source: Previous Bookmark
pt_br: Marcador anterior

source: Toggle Bookmark
pt_br: Alternar marcador

source: Clear Document Bookmarks
pt_br: Remover marcadores do documento

source: Editor Bookmarks
pt_br: Editor de marcadores

source: Contains support for bookmarks handling in the edited files
pt_br: Contém suporte para a manipulação de marcadores nos arquivos editados

source: Editor Bookmarks module contains support for adding/removing/jumping through the bookmarks in the edited source files.
pt_br: O módulo editor de marcadores contém suporte para adicionar/remover/pular através dos marcadores do arquivo de origem em edição.

source: Editor Code Folding
pt_br: Dobramento de código do editor

source: Contains support for Code Folding in Editor
pt_br: Contém suporte para o dobramento de código no editor

source: Code Folding is a submodule of Editor containing API, SPI and infrastructure for Code Folding.
pt_br: Dobramento de código é um submódulo do editor que contém API, SPI e infra-estrutura para o dobramento de código.

source: The module is generic and can be used with any Swing based editor.
pt_br: O módulo é genérico e pode ser utilizado por qualquer editor baseado em Swing.

source: Support for highlighting matching braces
pt_br: Suporte para realce de chaves correspondentes

source: This module adds support for highlighting matching areas of text in a document.
pt_br: Este módulo permite destacar as áreas correspondentes do texto no documento.

source: These areas can be for example braces, brackets or parenthesis, but they can also be XML tags or others.
pt_br: Estas áreas podem ser por exemplo, chaves, colchetes ou parênteses, e além disso podem ser tags XML ou outros.

source: The module implements highlighting and navigation (Jump-To) between the matching areas.
pt_br: O módulo implementa o realce e a navegação (ir para) entre as áreas correspondentes.

source: The areas are automatically detected as the caret is moved through a document.
pt_br: As áreas são automaticamente detectadas a medida que o cursor se move dentro do documento.

source: Editor Braces Matching
pt_br: Correspondência entre chaves no editor

source: Braces matching (match)
pt_br: Correspondência de chaves (combinação certa)

source: Braces matching (mismatch)
pt_br: Correspondência de chaves (combinação errada)

source: Insertion Point to Matching Brace
pt_br: Ponto de inserção para chaves correspondente

source: Allowed Search Direction:
pt_br: Direções de pesquisa permitidas:

source: Show parameters:
pt_br: Exibir parâmetros:

source: &Indentation
pt_br: &Indentação

source: Indentation
pt_br: Indentação

source: E&xpand Tabs to Spaces
pt_br: E&xpandir tabulações para espaços

source: N&umber of Spaces per Indent:
pt_br: N&úmero de espaços por indentação:

source: N&umber of Spaces per Indent
pt_br: N&úmero de espaços por indentação

source: Ta&b Size:
pt_br: Tamanho da ta&bulação

source: Ta&b Size
pt_br: Tamanho da ta&bulação

source: Rig&ht Margin:
pt_br: Margem direi&ta:

source: Rig&ht Margin
pt_br: Margem direi&ta:

source: Preview:
pt_br: Visualização:

source: Code &Templates
pt_br: &Modelos de código

source: &New
pt_br: &Novo

source: New
pt_br: Novo

source: Remo&ve
pt_br: Remo&ver

source: Expand Template &on:
pt_br: Expandir m&odelo para:

source: Set Expander Shortcut
pt_br: Definir atalho de expansão

source: Space
pt_br: Espaço

source: Shift+Space
pt_br: Shift+Espaço

source: Tab
pt_br: Aba

source: Tem&plates:
pt_br: &Modelos:

source: E&xpanded Text
pt_br: Texto e&xpandido

source: &Description
pt_br: &Descrição

source: &Language:
pt_br: &Linguagem:

source: Description
pt_br: Descrição

source: Expanded Text
pt_br: Texto expandido

source: New Code Template Dialog
pt_br: Diálogo de novo modelo de código

source: Duplicate abbreviation not allowed!
pt_br: Não é permitido abreviação duplicada!

source: Empty abbreviation not allowed!
pt_br: Não é permitido abreviação em branco!

source: Code template details
pt_br: Detalhes do modelo de código

source: Editor Options
pt_br: Opções do editor

source: Provides the editor related panels in the Options dialog.
pt_br: Fornece o painel mais comum nas opções de diálogo.

source: Provides Tools | Options dialog panels such as Editor, Fonts and Colors, and Keymap.
pt_br: Fornece o painel de diálogo Ferramentas | Opções, como por exemplo as opções Editor, Fontes e cores, e Mapa de teclas.

source: Build
pt_br: Construir

source: File
pt_br: Arquivo

source: Form
pt_br: Formulário

source: Help
pt_br: Ajuda

source: Refactor
pt_br: Refatorar

source: Run
pt_br: Executar

source: Source
pt_br: Fonte

source: Tools
pt_br: Ferramentas

source: Window
pt_br: Janela

source: System
pt_br: Sistema

source: Keymap Options
pt_br: Opções do mapa de teclas

source: &Keymap
pt_br: Mapa de &teclas

source: Keymap
pt_br: Mapa de teclas

source: D&uplicate ...
pt_br: D&uplicar...

source: Duplicate
pt_br: Duplicar

source: Dele&te
pt_br: Excluir

source: &Restore
pt_br: &Restaurar

source: Restore
pt_br: Restaurar

source: Actio&ns
pt_br: Açõ&es

source: &Shortcuts
pt_br: Atalho&s

source: Shortcuts
pt_br: Atalhos

source: A&dd ...
pt_br: A&dicionar ...

source: Actio&ns:
pt_br: Açõ&es:

source: &Shortcuts:
pt_br: Atalho&s:

source: Profiles
pt_br: Perfis

source: &Keymaps
pt_br: Mapa de &teclas

source: &Profile:
pt_br: &Perfil:

source: &View By
pt_br: &Visualizado por

source: &Shortcut:
pt_br: Atal&ho:

source: Add Shortcut Dialog
pt_br: Caixa de diálogo para adicionar atalho

source: Profile Name:
pt_br: Nome do perfil:

source: Create New Profile Dialog
pt_br: Caixa de diálogo para criar novo perfil

source: Shortcut already assigned to {0} Action.
pt_br: Atalho já definido para a ação {0}.

source: &Clear
pt_br: Limpar

source: &Tab
pt_br: A&ba

source: Profile with such name already exists.
pt_br: Um perfil com este nome já existe.

source: Choose different name, please.
pt_br: Favor escolher um nome diferente.

source: Export IDE Actions to XML
pt_br: Exportar ações do IDE para XML

source: Export IDE Shortcuts to XML
pt_br: Exportar atalhos do IDE para XML

source: Export Editor Shortcuts to XML
pt_br: Exportar atalhos do editor para XML

source: Export Shortcuts to HTML
pt_br: Exportar atalhos para HTML

source: Other
pt_br: Outro

source: Gene&ral
pt_br: Ge&ral

source: &Use Code Folding:
pt_br: &Utilizar dobramento de código:

source: Collapse by Default:
pt_br: Dobrar por padrão:

source: Meth&ods
pt_br: Mét&odos

source: Inner Classes
pt_br: Classes internas

source: Imports
pt_br: Importações

source: &Javadoc Comments
pt_br: Comentários &Javadoc

source: Initial Comment
pt_br: Comentário inicial

source: Code Completion:
pt_br: Auto-completar de código:

source: Auto &Popup Completion Window
pt_br: Janela &pop-up de auto-completar automática

source: Insert Single Proposals Automatically
pt_br: Inserir proposta única automaticamente

source: Case Sensitive Code Completion
pt_br: Auto-completar de código com distinção de maiúsculas/minúsculas

source: Show &Deprecated Members In Code Completion
pt_br: Exibir membros obsoletos no auto-completar de có&digo

source: Insert Closing Brackets Automatically
pt_br: Inserir fechamento de parênteses automaticamente

source: Camel Case Behavior
pt_br: Comportamento do Camel Case

source: Enable Camel Case Navigation For Java
pt_br: Habilitar a navegação por palavras unidas e iniciadas por maiúscula para Java

source: (Example: Caret stops at J, T, N in "JavaTypeName" when using next/previous word actions)
pt_br: Exemplo: Cursor pára em J, T, N em "JavaTypeName" quando utilizada a ação de próxima palavra/palavra anterior)

source: Macro Co&de:
pt_br: Có&digo da macro:

source: Name
pt_br: Nome

source: Shortcut
pt_br: Atalho

source: Macro Name:
pt_br: Nome da macro:

source: New Macro Dialog
pt_br: Caixa de diálogo para nova macro

source: Set Sh&ortcut...
pt_br: Definir atalh&o...

source: Set Shortcut
pt_br: Definir atalho

source: Duplicate macro name not allowed!
pt_br: Não é permitido nome duplicado para macros!

source: Table of Macros
pt_br: Tabela de macros

source: &Fonts & Colors
pt_br: Fontes & cores

source: Color Profile
pt_br: Perfil de cor

source: &Duplicate ...
pt_br: &Duplicar...

source: &Delete
pt_br: Excluir

source: High&lighting
pt_br: Rea&lce

source: &Syntax
pt_br: &Sintaxe

source: A&nnotations
pt_br: A&notações

source: Clone
pt_br: Clonar

source: Categories
pt_br: Categorias

source: Effects
pt_br: Efeitos

source: Languages
pt_br: Linguagens

source: Foreground Chooser
pt_br: Seletor de primeiro plano

source: Foreground
pt_br: Primeiro plano

source: Background Chooser
pt_br: Seletor de segundo plano

source: Background
pt_br: Segundo plano

source: Efects Color Chooser
pt_br: Seletor de cor dos efeitos

source: Efects Color
pt_br: Cor dos efeitos

source: Lang&uage:
pt_br: Ling&uagem:

source: Ca&tegory:
pt_br: Ca&tegoria:

source: Fo&reground:
pt_br: Primei&ro plano:

source: &Background:
pt_br: Se&gundo plano:

source: Effects:
pt_br: Efeitos:

source: Effect Color:
pt_br: Cor do efeito:

source: &Wave Underlined:
pt_br: Sublinhado em o&nda:

source: F&ont:
pt_br: F&onte:

source: None
pt_br: Nenhum

source: Underlined
pt_br: Sublinhado

source: Wave Underlined
pt_br: Sublinhado ondulado

source: Strike Through
pt_br: Tachado

source: Bold
pt_br: Negrito

source: Italic
pt_br: Itálico

source: Inherited
pt_br: Herdado

source: Font Chooser
pt_br: Seletor de fonte

source: Custom ...
pt_br: Personalizado ...

source: Black
pt_br: Preto

source: Blue
pt_br: Azul

source: Cyan
pt_br: Azul-claro

source: Dark Gray
pt_br: Cinza escuro

source: Gray
pt_br: Cinza

source: Green
pt_br: Verde

source: Light Gray
pt_br: Cinza claro

source: Magenta
pt_br: Violeta

source: Orange
pt_br: Laranja

source: Pink
pt_br: Rosa

source: Red
pt_br: Vermelho

source: White
pt_br: Branco

source: Yellow
pt_br: Amarelo

source: Select Color
pt_br: Selecionar cor

source: All Languages
pt_br: Todas as linguagens
